#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 2d3b740c2dd5eff6feb4c64f931b4f8f.pdb
; shader hash: 2d3b740c2dd5eff6feb4c64f931b4f8f
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer $Globals
; {
;
;   struct $Globals
;   {
;
;       uint2 imageSize;                              ; Offset:    0
;   
;   } $Globals;                                       ; Offset:    0 Size:     8
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; $Globals                          cbuffer      NA          NA     CB0            cb0     1
; rgb                                   UAV     f32          2d      U0             u0     1
; yuv_luminance                         UAV     f32          2d      U1             u1     1
; yuv_chrominance                       UAV     f32          2d      U2             u2     1
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !21, globals: !37)
!1 = !DIFile(filename: "RgbToYuvCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !13}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 18, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 18, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 18, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 2)
!13 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 70, baseType: !14)
!14 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 3, size: 64, align: 32, elements: !15, templateParams: !19)
!15 = !{!16, !18}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !14, file: !1, line: 3, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!17 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !14, file: !1, line: 3, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!19 = !{!20, !12}
!20 = !DITemplateTypeParameter(name: "element", type: !17)
!21 = !{!22, !35, !36}
!22 = !DISubprogram(name: "main", scope: !1, file: !1, line: 76, type: !23, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!23 = !DISubroutineType(types: !24)
!24 = !{null, !25, !25}
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 5, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 5, size: 96, align: 32, elements: !27, templateParams: !32)
!27 = !{!28, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 5, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 5, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, line: 5, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!32 = !{!33, !34}
!33 = !DITemplateTypeParameter(name: "element", type: !29)
!34 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 3)
!35 = !DISubprogram(name: "OutputY", linkageName: "\01?OutputY@@YAXV?$vector@I$02@@0@Z", scope: !1, file: !1, line: 7, type: !23, isLocal: false, isDefinition: true, scopeLine: 8, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubprogram(name: "OutputUV", linkageName: "\01?OutputUV@@YAXV?$vector@I$02@@0@Z", scope: !1, file: !1, line: 35, type: !23, isLocal: false, isDefinition: true, scopeLine: 36, flags: DIFlagPrototyped, isOptimized: false)
!37 = !{!38, !46, !58, !61}
!38 = !DIGlobalVariable(name: "imageSize", linkageName: "\01?imageSize@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 5, type: !39, isLocal: false, isDefinition: true)
!39 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !40)
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 5, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 5, size: 64, align: 32, elements: !42, templateParams: !45)
!42 = !{!43, !44}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 5, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 5, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !{!33, !12}
!46 = !DIGlobalVariable(name: "rgb", linkageName: "\01?rgb@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 1, type: !47, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 4> >"* @"\01?rgb@@3V?$RWTexture2D@V?$vector@M$03@@@@A")
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 1, size: 128, align: 32, elements: !2, templateParams: !48)
!48 = !{!49}
!49 = !DITemplateTypeParameter(name: "element", type: !50)
!50 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 1, size: 128, align: 32, elements: !51, templateParams: !56)
!51 = !{!52, !53, !54, !55}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !50, file: !1, line: 1, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !50, file: !1, line: 1, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !50, file: !1, line: 1, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !50, file: !1, line: 1, baseType: !17, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!56 = !{!20, !57}
!57 = !DITemplateValueParameter(name: "element_count", type: !8, value: i32 4)
!58 = !DIGlobalVariable(name: "yuv_luminance", linkageName: "\01?yuv_luminance@@3V?$RWTexture2D@M@@A", scope: !0, file: !1, line: 2, type: !59, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<float>"* @"\01?yuv_luminance@@3V?$RWTexture2D@M@@A")
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<float>", file: !1, line: 2, size: 32, align: 32, elements: !2, templateParams: !60)
!60 = !{!20}
!61 = !DIGlobalVariable(name: "yuv_chrominance", linkageName: "\01?yuv_chrominance@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 3, type: !62, isLocal: false, isDefinition: true, variable: %"class.RWTexture2D<vector<float, 2> >"* @"\01?yuv_chrominance@@3V?$RWTexture2D@V?$vector@M$01@@@@A")
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 3, size: 64, align: 32, elements: !2, templateParams: !63)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "element", type: !14)
!65 = !{i32 2, !"Dwarf Version", i32 4}
!66 = !{i32 2, !"Debug Info Version", i32 3}
!67 = !{!"dxc 1.2"}
!68 = !{!"RgbToYuvCS.hlsl", !"RWTexture2D<float4> rgb : register(u0);\0D\0ARWTexture2D<float> yuv_luminance : register(u1);\0D\0ARWTexture2D<float2> yuv_chrominance : register(u2);\0D\0A\0D\0Auint2 imageSize : register(b0);\0D\0A\0D\0Avoid OutputY(uint3 groupID, uint3 threadID)\0D\0A{\0D\0A    int srcX = (groupID.x * 64) + threadID.x;\0D\0A    int srcY = groupID.y;\0D\0A\0D\0A    if (srcX >= imageSize.x)\0D\0A        return;\0D\0A\0D\0A    if (srcY >= imageSize.y)\0D\0A        return;\0D\0A\0D\0A    int2 srcCoord = int2(srcX, srcY);\0D\0A\0D\0A    float r = rgb[srcCoord].r;\0D\0A    float g = rgb[srcCoord].g;\0D\0A    float b = rgb[srcCoord].b;\0D\0A\0D\0A    // Reference: https://docs.microsoft.com/en-us/windows/win32/medfound/recommended-8-bit-yuv-formats-for-video-rendering\0D\0A    float y = 0.256788 * r + 0.504129 * g + 0.097906 * b;\0D\0A\0D\0A    y = max(y, 0.0f);\0D\0A    y = min(y, 1.0f);\0D\0A\0D\0A    float luminance = y;\0D\0A    int2 dstCoord = srcCoord;\0D\0A    yuv_luminance[dstCoord] = luminance;\0D\0A}\0D\0A\0D\0Avoid OutputUV(uint3 groupID, uint3 threadID)\0D\0A{\0D\0A    int ql = (groupID.x * 128) + (threadID.x * 2); // quad left\0D\0A    int qt = (groupID.y * 2); // quad top\0D\0A\0D\0A    if (ql >= imageSize.x)\0D\0A        return;\0D\0A\0D\0A    if (qt >= imageSize.y)\0D\0A        return;\0D\0A\0D\0A    int2 src0 = int2(ql + 0, qt + 0); // top left\0D\0A    int2 src1 = int2(ql + 1, qt + 0); // top right\0D\0A    int2 src2 = int2(ql + 0, qt + 1); // bottom left\0D\0A    int2 src3 = int2(ql + 1, qt + 1); // bottom right\0D\0A\0D\0A    float3 rgb0 = rgb[src0].rgb;\0D\0A    float3 rgb1 = rgb[src1].rgb;\0D\0A    float3 rgb2 = rgb[src2].rgb;\0D\0A    float3 rgb3 = rgb[src3].rgb;\0D\0A\0D\0A    float3 avg = (rgb0 + rgb1 + rgb2 + rgb3) / 4.0f;\0D\0A\0D\0A    float r = avg.r;\0D\0A    float g = avg.g;\0D\0A    float b = avg.b;\0D\0A\0D\0A    float u = -0.148223 * r - 0.290993 * g + 0.439216 * b;\0D\0A    float v = 0.439216 * r - 0.367788 * g - 0.071427 * b;\0D\0A\0D\0A    u = max(u, 0.0f);\0D\0A    v = max(v, 0.0f);\0D\0A    u = min(u, 1.0f);\0D\0A    v = min(v, 1.0f);\0D\0A\0D\0A    float2 chrominance = float2(u, v);\0D\0A    int2 destCoord = int2((groupID.x * 64) + threadID.x, groupID.y);\0D\0A    yuv_chrominance[destCoord] = chrominance;\0D\0A}\0D\0A\0D\0A[numthreads(64, 1, 1)]\0D\0Avoid main( uint3 groupID : SV_GroupID, uint3 threadID : SV_GroupThreadID )\0D\0A{\0D\0A    OutputY(groupID, threadID);\0D\0A\0D\0A    OutputUV(groupID, threadID);\0D\0A}"}
!69 = !{!"RgbToYuvCS.hlsl"}
!70 = !{!"/E", !"main", !"/T", !"cs_6_0", !"/Fo", !"C:\5CUsers\5CClaire\5Csource\5Crepos\5Crgb2yuv\5Cx64\5CDebug\5CRgbToYuvCS.cso", !"/Od", !"/Zi"}
!71 = !{i32 1, i32 0}
!72 = !{i32 1, i32 5}
!73 = !{!"cs", i32 6, i32 0}
!74 = !{null, !75, !80, null}
!75 = !{!76, !78, !79}
!76 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >"* undef, !"rgb", i32 0, i32 0, i32 1, i32 2, i1 false, i1 false, i1 false, !77}
!77 = !{i32 0, i32 9}
!78 = !{i32 1, %"class.RWTexture2D<float>"* undef, !"yuv_luminance", i32 0, i32 1, i32 1, i32 2, i1 false, i1 false, i1 false, !77}
!79 = !{i32 2, %"class.RWTexture2D<vector<float, 2> >"* undef, !"yuv_chrominance", i32 0, i32 2, i32 1, i32 2, i1 false, i1 false, i1 false, !77}
!80 = !{!81}
!81 = !{i32 0, %"$Globals"* undef, !"$Globals", i32 0, i32 0, i32 1, i32 8, null}
!82 = !{i32 0, %"class.RWTexture2D<vector<float, 4> >" undef, !83, %"class.RWTexture2D<float>" undef, !85, %"class.RWTexture2D<vector<float, 2> >" undef, !86, %"$Globals" undef, !87}
!83 = !{i32 16, !84}
!84 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!85 = !{i32 4, !84}
!86 = !{i32 8, !84}
!87 = !{i32 8, !88}
!88 = !{i32 6, !"imageSize", i32 3, i32 0, i32 7, i32 5}
!89 = !{i32 1, void ()* @main, !90}
!90 = !{!91}
!91 = !{i32 0, !2, !2}
!92 = !{void ()* @main, !"main", null, !74, !93}
!93 = !{i32 0, i64 8193, i32 4, !94}
!94 = !{i32 64, i32 1, i32 1}
!95 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threadID", arg: 2, scope: !22, file: !1, line: 76, type: !25)
!96 = !DIExpression()
!97 = !DILocation(line: 76, column: 46, scope: !22)
!98 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupID", arg: 1, scope: !22, file: !1, line: 76, type: !25)
!99 = !DILocation(line: 76, column: 18, scope: !22)
!100 = !DILocation(line: 78, column: 22, scope: !22)
!101 = !DILocation(line: 78, column: 13, scope: !22)
!102 = !DILocation(line: 78, column: 5, scope: !22)
!103 = !DILocation(line: 9, column: 17, scope: !35, inlinedAt: !104)
!104 = distinct !DILocation(line: 78, column: 5, scope: !22)
!105 = !DILocation(line: 9, column: 27, scope: !35, inlinedAt: !104)
!106 = !DILocation(line: 9, column: 35, scope: !35, inlinedAt: !104)
!107 = !DILocation(line: 9, column: 33, scope: !35, inlinedAt: !104)
!108 = !DILocation(line: 9, column: 9, scope: !35, inlinedAt: !104)
!109 = !DILocation(line: 10, column: 16, scope: !35, inlinedAt: !104)
!110 = !DILocation(line: 10, column: 9, scope: !35, inlinedAt: !104)
!111 = !DILocation(line: 12, column: 9, scope: !112, inlinedAt: !104)
!112 = distinct !DILexicalBlock(scope: !35, file: !1, line: 12, column: 9)
!113 = !DILocation(line: 12, column: 17, scope: !112, inlinedAt: !104)
!114 = !DILocation(line: 12, column: 14, scope: !112, inlinedAt: !104)
!115 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "threadID", arg: 2, scope: !36, file: !1, line: 35, type: !25)
!116 = !DILocation(line: 35, column: 36, scope: !36, inlinedAt: !117)
!117 = distinct !DILocation(line: 80, column: 5, scope: !22)
!118 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "groupID", arg: 1, scope: !36, file: !1, line: 35, type: !25)
!119 = !DILocation(line: 35, column: 21, scope: !36, inlinedAt: !117)
!120 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "ql", scope: !36, file: !1, line: 37, type: !8)
!121 = !DILocation(line: 37, column: 9, scope: !36, inlinedAt: !117)
!122 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "qt", scope: !36, file: !1, line: 38, type: !8)
!123 = !DILocation(line: 38, column: 9, scope: !36, inlinedAt: !117)
!124 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src0", scope: !36, file: !1, line: 46, type: !4)
!125 = !DILocation(line: 46, column: 10, scope: !36, inlinedAt: !117)
!126 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src1", scope: !36, file: !1, line: 47, type: !4)
!127 = !DILocation(line: 47, column: 10, scope: !36, inlinedAt: !117)
!128 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src2", scope: !36, file: !1, line: 48, type: !4)
!129 = !DILocation(line: 48, column: 10, scope: !36, inlinedAt: !117)
!130 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "src3", scope: !36, file: !1, line: 49, type: !4)
!131 = !DILocation(line: 49, column: 10, scope: !36, inlinedAt: !117)
!132 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb0", scope: !36, file: !1, line: 51, type: !133)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 51, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 51, size: 96, align: 32, elements: !135, templateParams: !139)
!135 = !{!136, !137, !138}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !134, file: !1, line: 51, baseType: !17, size: 32, align: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !134, file: !1, line: 51, baseType: !17, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !134, file: !1, line: 51, baseType: !17, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!139 = !{!20, !34}
!140 = !DILocation(line: 51, column: 12, scope: !36, inlinedAt: !117)
!141 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb1", scope: !36, file: !1, line: 52, type: !133)
!142 = !DILocation(line: 52, column: 12, scope: !36, inlinedAt: !117)
!143 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb2", scope: !36, file: !1, line: 53, type: !133)
!144 = !DILocation(line: 53, column: 12, scope: !36, inlinedAt: !117)
!145 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "rgb3", scope: !36, file: !1, line: 54, type: !133)
!146 = !DILocation(line: 54, column: 12, scope: !36, inlinedAt: !117)
!147 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "avg", scope: !36, file: !1, line: 56, type: !133)
!148 = !DILocation(line: 56, column: 12, scope: !36, inlinedAt: !117)
!149 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "r", scope: !36, file: !1, line: 58, type: !17)
!150 = !DILocation(line: 58, column: 11, scope: !36, inlinedAt: !117)
!151 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "g", scope: !36, file: !1, line: 59, type: !17)
!152 = !DILocation(line: 59, column: 11, scope: !36, inlinedAt: !117)
!153 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "b", scope: !36, file: !1, line: 60, type: !17)
!154 = !DILocation(line: 60, column: 11, scope: !36, inlinedAt: !117)
!155 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "u", scope: !36, file: !1, line: 62, type: !17)
!156 = !DILocation(line: 62, column: 11, scope: !36, inlinedAt: !117)
!157 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "v", scope: !36, file: !1, line: 63, type: !17)
!158 = !DILocation(line: 63, column: 11, scope: !36, inlinedAt: !117)
!159 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "chrominance", scope: !36, file: !1, line: 70, type: !13)
!160 = !DILocation(line: 70, column: 12, scope: !36, inlinedAt: !117)
!161 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "destCoord", scope: !36, file: !1, line: 71, type: !4)
!162 = !DILocation(line: 71, column: 10, scope: !36, inlinedAt: !117)
!163 = !DILocation(line: 12, column: 9, scope: !35, inlinedAt: !104)
!164 = !DILocation(line: 15, column: 9, scope: !165, inlinedAt: !104)
!165 = distinct !DILexicalBlock(scope: !35, file: !1, line: 15, column: 9)
!166 = !DILocation(line: 15, column: 17, scope: !165, inlinedAt: !104)
!167 = !DILocation(line: 15, column: 14, scope: !165, inlinedAt: !104)
!168 = !DILocation(line: 15, column: 9, scope: !35, inlinedAt: !104)
!169 = !DILocation(line: 18, column: 26, scope: !35, inlinedAt: !104)
!170 = !DILocation(line: 18, column: 32, scope: !35, inlinedAt: !104)
!171 = !DILocation(line: 18, column: 10, scope: !35, inlinedAt: !104)
!172 = !DILocation(line: 20, column: 19, scope: !35, inlinedAt: !104)
!173 = !DILocation(line: 20, column: 15, scope: !35, inlinedAt: !104)
!174 = !DILocation(line: 20, column: 11, scope: !35, inlinedAt: !104)
!175 = !DILocation(line: 21, column: 19, scope: !35, inlinedAt: !104)
!176 = !DILocation(line: 21, column: 15, scope: !35, inlinedAt: !104)
!177 = !DILocation(line: 21, column: 11, scope: !35, inlinedAt: !104)
!178 = !DILocation(line: 22, column: 19, scope: !35, inlinedAt: !104)
!179 = !DILocation(line: 22, column: 15, scope: !35, inlinedAt: !104)
!180 = !DILocation(line: 22, column: 11, scope: !35, inlinedAt: !104)
!181 = !DILocation(line: 25, column: 26, scope: !35, inlinedAt: !104)
!182 = !DILocation(line: 25, column: 24, scope: !35, inlinedAt: !104)
!183 = !DILocation(line: 25, column: 41, scope: !35, inlinedAt: !104)
!184 = !DILocation(line: 25, column: 39, scope: !35, inlinedAt: !104)
!185 = !DILocation(line: 25, column: 28, scope: !35, inlinedAt: !104)
!186 = !DILocation(line: 25, column: 56, scope: !35, inlinedAt: !104)
!187 = !DILocation(line: 25, column: 54, scope: !35, inlinedAt: !104)
